# Creating Series

In [96]:
#EXP - 3

In [121]:
# Aim : Creating the Dataframe

In [122]:
# Name: Nandini Bandu Wankhade
# Roll no.:70
# Sec : B
# Subject:ET1
# Date:07/08/2025

In [123]:
import pandas as pd

In [124]:
Name=["Nandini","Tanisha","Avantika","Komal"]
Name

['Nandini', 'Tanisha', 'Avantika', 'Komal']

In [125]:
Roll_list=pd.Series(Name,index=[1,2,3,4])
print(Roll_list)

1     Nandini
2     Tanisha
3    Avantika
4       Komal
dtype: object

# Creating Data Frame

In [126]:
import pandas as pd

In [127]:
df=pd.DataFrame([[10,12,13,14],[11,12,14,15],[11,16,29,19],[10,12,13,14],[11,12,14,15],[11,16,29,19]],
columns= ["CD","DBMS","DSS","CAO"])

In [128]:
df

   CD  DBMS  DSS  CAO
0  10    12   13   14
1  11    12   14   15
2  11    16   29   19
3  10    12   13   14
4  11    12   14   15
5  11    16   29   19

In [129]:
df.shape

(6, 4)

In [130]:
df.size

24

In [131]:
df.ndim

2

# Adding Record(row) to the data frame

In [132]:
df

   CD  DBMS  DSS  CAO
0  10    12   13   14
1  11    12   14   15
2  11    16   29   19
3  10    12   13   14
4  11    12   14   15
5  11    16   29   19

In [133]:
df2=pd.DataFrame([[5,6,7,8]],
columns= ["CD","DBMS","DSS","CAO"])

In [134]:
df3 = pd.concat([df, df2], ignore_index=True)

In [135]:
df3

   CD  DBMS  DSS  CAO
0  10    12   13   14
1  11    12   14   15
2  11    16   29   19
3  10    12   13   14
4  11    12   14   15
5  11    16   29   19
6   5     6    7    8

# Adding Attribute(column) in a data frame

In [136]:
df3["DM"]=[12,15,12,13,16,20,4]

In [137]:
df3

   CD  DBMS  DSS  CAO  DM
0  10    12   13   14  12
1  11    12   14   15  15
2  11    16   29   19  12
3  10    12   13   14  13
4  11    12   14   15  16
5  11    16   29   19  20
6   5     6    7    8   4

# Deleting Record from Data Frame

In [138]:
df4=df3.drop(1)

In [139]:
df4

   CD  DBMS  DSS  CAO  DM
0  10    12   13   14  12
2  11    16   29   19  12
3  10    12   13   14  13
4  11    12   14   15  16
5  11    16   29   19  20
6   5     6    7    8   4

# Deleting Attribute (columns) from Data Frame

In [140]:
df5=df3.drop(columns=["DM"])

In [141]:
df5

   CD  DBMS  DSS  CAO
0  10    12   13   14
1  11    12   14   15
2  11    16   29   19
3  10    12   13   14
4  11    12   14   15
5  11    16   29   19
6   5     6    7    8

# Finding Mean,Median,Mode Of DSS

In [142]:
print("Mean of DSS :", df5["DSS"].mean())

Mean of DSS : 17.0

In [143]:
print("Median of DSS :", df5["DSS"].median())

Median of DSS : 14.0

In [144]:
print("Mode of DSS :", df5["DSS"].mode())

Mode of DSS : 0    13
1    14
2    29
Name: DSS, dtype: int64